task/src/main/resources/GetReservation_1.18.0.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:stl1="http://webservices.sabre.com/pnrbuilder/v1_18" xmlns:tns="http://webservices.sabre.com/pnrbuilder/getres" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext"
             name="GetReservationWSDL" targetNamespace="http://webservices.sabre.com/pnrbuilder/getres">
	<wsdl:types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="msg-header-2_0.xsd"/>
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="wsse.xsd"/>
			<xsd:import namespace="http://webservices.sabre.com/pnrbuilder/v1_18" schemaLocation="PNRBuilderTypes_v1.18.0.xsd"/>
			<xsd:import namespace="http://webservices.sabre.com/pnrbuilder/v1_18" schemaLocation="GetReservationSTLRQ_v1.18.0.xsd"/>
			<xsd:import namespace="http://webservices.sabre.com/pnrbuilder/v1_18" schemaLocation="GetReservationSTLRS_v1.18.0.xsd"/>
			<xsd:import namespace="http://services.sabre.com/res/or/v1_12" schemaLocation="OpenReservation.1.12.0.xsd"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="GetReservationInput">
		<wsdl:part element="eb:MessageHeader" name="header"/>
		<wsdl:part element="wsse:Security" name="header2"/>
		<wsdl:part element="stl1:GetReservationRQ" name="body"/>
	</wsdl:message>
	<wsdl:message name="GetReservationOutput">
		<wsdl:part element="eb:MessageHeader" name="header"/>
		<wsdl:part element="wsse:Security" name="header2"/>
		<wsdl:part element="stl1:GetReservationRS" name="body"/>
	</wsdl:message>
	<wsdl:portType name="GetReservationPortType">
		<wsdl:operation name="GetReservationOperation">
			<wsdl:input message="tns:GetReservationInput"/>
			<wsdl:output message="tns:GetReservationOutput"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="GetReservationSoapBinding" type="tns:GetReservationPortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>

		<wsdl:operation name="GetReservationOperation">
            <soap:operation soapAction="GetReservationOperation"/>
			<wsdl:input>
				<soap:header message="tns:GetReservationInput" part="header" use="literal"/>
				<soap:header message="tns:GetReservationInput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:header message="tns:GetReservationOutput" part="header" use="literal"/>
				<soap:header message="tns:GetReservationOutput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="GetReservationService">
		<wsdl:port binding="tns:GetReservationSoapBinding" name="GetReservationPortType">
			<soap:address location="http://localhost:8088/mockGetReservationSoapBinding"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
