.metadata/.plugins/org.eclipse.core.resources/.history/eb/8011720e64b7001913d4a77bf3b01b9d

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v1="http://webservices.sabre.com/pnrbuilder/v1_18" xmlns:v11="http://services.sabre.com/res/or/v1_12">
   <soapenv:Header>
      <sec:Security>
         <!--Optional:-->
         <sec:UsernameToken>
            <!--Optional:-->
            <sec:Username>?</sec:Username>
            <!--Optional:-->
            <sec:Password>?</sec:Password>
            <!--0 to 2 repetitions:-->
            <sec:NewPassword>?</sec:NewPassword>
            <!--Optional:-->
            <Organization>?</Organization>
            <!--Optional:-->
            <Domain>?</Domain>
         </sec:UsernameToken>
         <!--Optional:-->
         <sec:SabreAth>?</sec:SabreAth>
         <!--Optional:-->
         <sec:BinarySecurityToken>?</sec:BinarySecurityToken>
      </sec:Security>
      <mes:MessageHeader mes:id="?" mes:version="?">
         <mes:From>
            <!--1 or more repetitions:-->
            <mes:PartyId mes:type="?">?</mes:PartyId>
            <!--Optional:-->
            <mes:Role>?</mes:Role>
         </mes:From>
         <mes:To>
            <!--1 or more repetitions:-->
            <mes:PartyId mes:type="?">?</mes:PartyId>
            <!--Optional:-->
            <mes:Role>?</mes:Role>
         </mes:To>
         <mes:CPAId>?</mes:CPAId>
         <mes:ConversationId>?</mes:ConversationId>
         <mes:Service mes:type="?">?</mes:Service>
         <mes:Action>?</mes:Action>
         <mes:MessageData>
            <mes:MessageId>?</mes:MessageId>
            <mes:Timestamp>?</mes:Timestamp>
            <!--Optional:-->
            <mes:RefToMessageId>?</mes:RefToMessageId>
            <!--Optional:-->
            <mes:TimeToLive>?</mes:TimeToLive>
         </mes:MessageData>
         <!--Optional:-->
         <mes:DuplicateElimination>?</mes:DuplicateElimination>
         <!--Zero or more repetitions:-->
         <mes:Description xml:lang="?">?</mes:Description>
         <!--You may enter ANY elements at this point-->
      </mes:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
     <ns6:GetReservationRQ xmlns:ns1="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns2="http://www.w3.org/1999/xlink" xmlns:ns3="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns6="http://webservices.sabre.com/pnrbuilder/v1_18" xmlns:ns7="http://services.sabre.com/res/or/v1_12" xmlns:ns8="http://www.w3.org/2000/09/xmldsig#" Version="1.18.0">
    <ns6:Locator>QTWMUM</ns6:Locator>
    <ns6:RequestType>Stateless</ns6:RequestType>
    <ns6:ReturnOptions>
        <ns6:ViewName>SswDefault</ns6:ViewName>
        <ns6:ResponseFormat>STL</ns6:ResponseFormat>
    </ns6:ReturnOptions>
</ns6:GetReservationRQ>
   </soapenv:Body>
</soapenv:Envelope>